### First dataset

In [1]:
# import required libraries
import pandas as pd

In [2]:
# read first dataset
df = pd.read_csv('cosmic_chronometers.csv')
df.head()

   Unnamed: 0  Col1   Col2  Col3
0           0  0.09   69.0  12.0
1           1  0.17   83.0   8.0
2           2  0.27   77.0  14.0
3           3  0.49   95.0  17.0
4           4  0.90  117.0  23.0

In [3]:
# Check for NaN under the entire DataFrame:

df.isnull().any()

Unnamed: 0    False
Col1          False
Col2          False
Col3          False
dtype: bool

In [4]:
# Clean the data

df = df.drop('Unnamed: 0', 1)
df.head()

   Col1   Col2  Col3
0  0.09   69.0  12.0
1  0.17   83.0   8.0
2  0.27   77.0  14.0
3  0.49   95.0  17.0
4  0.90  117.0  23.0

In [5]:
# change the columns name
df = df.rename(columns={'Col1': 'z', 'Col2': 'H(z)', 'Col3':'Error'})
df.head()

      z   H(z)  Error
0  0.09   69.0   12.0
1  0.17   83.0    8.0
2  0.27   77.0   14.0
3  0.49   95.0   17.0
4  0.90  117.0   23.0